Script test/Performance Test/jmeter/scripts/report_004/statistics.json
{
  "GET_FilterCandidates_Heavy" : {
    "transaction" : "GET_FilterCandidates_Heavy",
    "sampleCount" : 5465,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12968.939798719153,
    "medianResTime" : 14497.0,
    "minResTime" : 159.0,
    "maxResTime" : 33797.0,
    "pct1ResTime" : 19302.0,
    "pct2ResTime" : 19592.0,
    "pct3ResTime" : 26099.0,
    "throughput" : 27.414233329487484,
    "receivedKBytesPerSec" : 728.3368644233857,
    "sentKBytesPerSec" : 5.97009182858956
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 5465,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12968.939798719153,
    "medianResTime" : 14497.0,
    "minResTime" : 159.0,
    "maxResTime" : 33797.0,
    "pct1ResTime" : 19302.0,
    "pct2ResTime" : 19592.0,
    "pct3ResTime" : 26099.0,
    "throughput" : 27.414233329487484,
    "receivedKBytesPerSec" : 728.3368644233857,
    "sentKBytesPerSec" : 5.97009182858956
  }
}