Script test/Performance Test/jmeter/scripts/PT_002_StressTest_CandidateFlow_HighLoad.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="PT_002_StressTest_CandidateFlow_HighLoad" enabled="true">
      <stringProp name="TestPlan.comments">Stress Test Luồng Nộp CV - Ép tải tìm ngưỡng sập (Target 1000 Users)</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">8081</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup guiclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroupGui" testclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup" testname="Stepping Load (Target 1000)" enabled="true">
        <stringProp name="TargetLevel">1000</stringProp>
        <stringProp name="RampUp">300</stringProp>
        <stringProp name="Steps">10</stringProp>
        <stringProp name="Hold">120</stringProp>
        <stringProp name="Unit">S</stringProp>
      </com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="01_GET_JobPosition" enabled="true">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/job-service/job-positions/62</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="Once Only Controller (Upload)" enabled="true"/>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="02_Upload_CV" enabled="true">
            <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
            <stringProp name="HTTPSampler.port">${PORT}</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/upload</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
            <elementProp name="HTTPsampler.Files" elementType="HTTPFileArgs">
              <collectionProp name="HTTPFileArgs.files">
                <elementProp name="CV.pdf" elementType="HTTPFileArg">
                  <stringProp name="File.path">CV.pdf</stringProp>
                  <stringProp name="File.paramname">file</stringProp>
                  <stringProp name="File.mimetype">application/pdf</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Regular Expression Extractor (cvUrl)" enabled="true">
              <stringProp name="RegexExtractor.refname">cvUrl</stringProp>
              <stringProp name="RegexExtractor.regex">^(.*)$</stringProp>
              <stringProp name="RegexExtractor.template">$1$</stringProp>
              <stringProp name="RegexExtractor.default">NOT_FOUND</stringProp>
              <stringProp name="RegexExtractor.match_number">1</stringProp>
            </RegexExtractor>
            <hashTree/>
          </hashTree>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="03_Create_Candidate" enabled="true">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/candidate-service/candidates</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="Argument.value">{&#xd;
    &quot;name&quot;: &quot;Ứng viên Stress ${__RandomString(5,abcdefgh)}&quot;,&#xd;
    &quot;email&quot;: &quot;stress_${__Random(1,999999)}@gmail.com&quot;,&#xd;
    &quot;phone&quot;: &quot;09${__Random(10000000,99999999)}&quot;,&#xd;
    &quot;jobPositionId&quot;: 62,&#xd;
    &quot;cvUrl&quot;: &quot;${cvUrl}&quot;,&#xd;
    &quot;notes&quot;: &quot;Stress Test tìm ngưỡng gãy&quot;&#xd;
}</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <JSR223Listener guiclass="TestBeanGUI" testclass="JSR223Listener" testname="Auto-Stop (1% Error)" enabled="true">
          <stringProp name="script">
            double threshold = 1.0; 
            long total = Long.parseLong(vars.get("t_req") ?: "0") + 1;
            long err = Long.parseLong(vars.get("t_err") ?: "0") + (sampleResult.isSuccessful() ? 0 : 1);
            vars.put("t_req", total.toString());
            vars.put("t_err", err.toString());
            // Chỉ bắt đầu kiểm tra sau 50 samples để tránh số liệu ảo lúc đầu
            if (total > 50 &amp;&amp; (err/(double)total)*100 > threshold) {
                log.error("--- TEST STOPPED DUE TO HIGH ERROR RATE: " + (err/(double)total)*100 + "% ---");
                ctx.getEngine().stopTest();
            }
          </stringProp>
        </JSR223Listener>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>